---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransaction.Commit
source: html/f6b01516-d3a8-8177-a605-cc14911b7a59.htm
---
# Autodesk.Revit.DB.IFC.IFCTransaction.Commit Method

Commits all changes made to the IFC file during the transaction.

## Syntax (C#)
```csharp
public void Commit()
```